Repository: IamSriKrishna/faculty
Catalog: lib/l10n/lang/intl_*.arb
Languages: ml

source: Good Morning
ml: ശുഭ പ്രഭാതം

source: Good Afternoon
ml: ശുഭ മധ്യാഹ്നം

source: Good Evening
ml: ശുഭ സന്ധ്യ

# homeScreenTitle
source: My Classes
ml: എന്റെ ക്ലാസുകൾ

source: On Duty
ml: ഡ്യൂട്ടിയില്

source: Leave
ml: അവസരം

source: Gate Pass
ml: ഗേറ്റ് പാസ്

source: My Class
ml: എന്റെ ക്ലാസ്

source: Credit
ml: വില

source: Notification
ml: അറിയിപ്പ്

source: My Profile
ml: എനറെ പ്രൊഫയിൽ

source: Forget Pin
ml: പിൻ മറന്നില്ല

source: Language
ml: ഭാഷ

source: Sign Out
ml: സൈൻ ഔട്ട്

# warningMessage
source: Your message appears to be significantly shorter than the recommended minimum of 5 words. Please provide more context or information to ensure clarity and effective communication.
ml: നിങ്ങളുടെ സന്ദേശം 5 വാക്കുകൾക്ക് പ്രതിശ്രദ്ധപ്പെടുന്ന നിശ്ചയമുള്ള അതിന്നു കുറച്ചു കൂടി സന്ദേശം നൽകുക. സ്പयाद സ്പयादന് തുടങ്ങി

# ondutyDetails
source: Record your work hours efficiently
ml: നിങ്ങളുടെ ജോലി സമയം കാര്യക്ഷമമായി രേഖപ്പെടുത്തുക

# leaveDetails
source: Request time off with ease
ml: അനായാസം സമയം അഭ്യർത്ഥിക്കുക

# gatePassDetails
source: Authorize entry and exit
ml: പ്രവേശനവും പുറത്തുകടക്കലും അംഗീകരിക്കുക

source: From
ml: മുതൽ

source: To
ml: വരെ

source: Today
ml: ഇന്ന്

source: Send
ml: അയച്ചിട്ടുക

source: Reason
ml: കാരണം

source: Profile
ml: പ്രൊഫൈൽ

source: About
ml: കുറിച്ച്

source: Approval
ml: അംഗീകരിക്കല്

# development
source: Feature in development, limited functionality, testing ongoing, your feedback valued, no release date set. Thanks for understanding.
ml: വികസനത്തിലെ ഫീച്ചർ, പരിമിതമായ പ്രവർത്തനക്ഷമത, പരിശോധന തുടരുന്നു, നിങ്ങളുടെ ഫീഡ്‌ബാക്ക് വിലമതിക്കുന്നു, റിലീസ് തീയതി നിശ്ചയിച്ചിട്ടില്ല. മനസ്സിലാക്കിയതിനു നന്ദി

source: Booking
ml: ബുക്കിങ്

source: Credit You Have
ml: നിനക്ക് ക്രെഡിറ്റ് ഉണ്ട്

source: Per Credit
ml: പെർ ക്രെഡിറ്റ്

source: Total days selected
ml: എന്തെങ്കിലും ദിവസങ്ങൾ തിരഞ്ഞെടുത്തു

source: Total Credit
ml: മൊത്ത ക്രെഡിറ്റ്

# continues
source: Continue
ml: തുടരുക

source: Warning!
ml: മുന്നറിയിപ്പ്!

# pleaseselectoneormoredaystocontinue
source: Please Select 1 or More days to continue
ml: തുടരുകയായിരിക്കുക 1 അല്ലെങ്കിൽ അതികമെങ്കിൽ ദിവസങ്ങൾ തിരഞ്ഞെടുക

source: OK
ml: ശരി

source: Kindly Refill Your Credit
ml: ദയചേഷ്ടയായി നിനക്ക് ക്രെഡിറ്റ് അടയ്ക്കുക

source: Name
ml: പേര്

source: Please do not exit this page Your credit will be lost.
ml: ഈ പേജ് ഇല്ലാതെ പോകരുത് നിനക്ക് ക്രെഡിറ്റ് ഇഴന്നുകൊള്ളും.

source: Cancel
ml: റദ്ദാക്കുക

source: Proceed
ml: തുടരുക

source: Roll Number
ml: റോൾ നമ്പർ

source: Department
ml: വിഭാഗം

source: No of Day
ml: ദിവസ എണ്ണം

source: No of Days
ml: ദിവസ എണ്ണം

source: Day
ml: ദിവസം

source: Days
ml: ദിവസങ്ങൾ

source: Enter Your Reason
ml: നിനക്ക് ആവശ്യമായ കാരണം നൽകുക

source: Submit
ml: സമർപ്പിക്കുക

source: History
ml: ചരിത്രം

source: Yes
ml: അതീവം

source: Want To Exit Campus~Link?
ml: കാമ്പസ്-ലിങ്കിൽ നിന്ന് പുറത്തുകടക്കാൻ ആഗ്രഹിക്കുന്നുണ്ടോ?

source: No
ml: ഇല്ല

source: Total Spend
ml: ആകെ ചെലവ്
